MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dma.h
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_dma.h
  * @brief   Header file of DMA HAL module.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32C5XX_HAL_DMA_H
#define STM32C5XX_HAL_DMA_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32c5xx_hal_def.h"
#include "stm32c5xx_ll_dma.h"
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
/* Include Q module for linked list management with associated features */
#define USE_HAL_Q_DIRECT_ADDR_MODE (1U) /*!< Use direct addressing mode for DMA queue */
#define USE_HAL_Q_CIRCULAR_LINK    (1U) /*!< Use circular linking for DMA queue       */
#include "stm32c5xx_hal_q.h"
#endif /* USE_HAL_DMA_LINKEDLIST */

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */
#if (defined (LPDMA1) || defined (LPDMA2))

/** @defgroup DMA DMA
  * @{
  */

/* Exported constants ------------------------------------------------------------------------------------------------*/
/** @defgroup DMA_Exported_Constants HAL DMA Constants
  * @{
  */
#if defined(USE_HAL_DMA_GET_LAST_ERRORS) && (USE_HAL_DMA_GET_LAST_ERRORS == 1)
/** @defgroup DMA_Error_Code Error code definition reflecting asynchronous process errors
  * @{
  */
#define HAL_DMA_ERROR_NONE    (0U)           /*!< DMA channel no error                              */
#define HAL_DMA_ERROR_DTE     (0x01UL << 0U) /*!< DMA channel data transfer error                   */
#define HAL_DMA_ERROR_USE     (0x01UL << 1U) /*!< DMA channel user setting error                    */
#define HAL_DMA_ERROR_TO      (0x01UL << 2U) /*!< DMA channel trigger overrun error                 */
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
#define HAL_DMA_ERROR_ULE     (0x01UL << 3U) /*!< DMA channel fetch node error                      */
#endif /* USE_HAL_DMA_LINKEDLIST */
/**
  * @}
  */
#endif /* USE_HAL_DMA_GET_LAST_ERRORS */

/** @defgroup DMA_Optional_Interrupt Optional interrupts
  * @{
  */
#define HAL_DMA_OPT_IT_NONE    (0U)                                    /*!< DMA channel optional interrupts Half
                                                                            Transfer(HT) and Trigger Overrun (TO)
                                                                            are disabled */
#define HAL_DMA_OPT_IT_HT      (0x01UL << 9U)                          /*!< DMA channel Half Transfer interrupt
                                                                            enabled   */
#define HAL_DMA_OPT_IT_TO      (0x01UL << 14U)                         /*!< DMA channel Trigger Overrun interrupt
                                                                            enabled */
#define HAL_DMA_OPT_IT_DEFAULT (HAL_DMA_OPT_IT_HT | HAL_DMA_OPT_IT_TO) /*!< DMA channel all optional interrupts
                                                                            i.e Half Transfer(HT) and
                                                                            Trigger Overrun (TO) are enabled */
#define HAL_DMA_OPT_IT_SILENT  ((uint32_t)0xFFFFFFFFU)                 /*!< DMA channel all interrupts are disabled,
                                                                            the DMA transfer will not issue any
                                                                            interrupt */
/**
  * @}
  */

/**
  * @}
  */

/* Exported types ----------------------------------------------------------------------------------------------------*/
/** @defgroup DMA_Exported_Types HAL DMA Types
  * @{
  */

/*! DMA channel instances enumeration definition */
typedef enum
{
  /* LPDMA1 channel instances */
  HAL_LPDMA1_CH0 = LPDMA1_CH0_BASE,  /*!< LPDMA1 Channel 0  */
  HAL_LPDMA1_CH1 = LPDMA1_CH1_BASE,  /*!< LPDMA1 Channel 1  */
  HAL_LPDMA1_CH2 = LPDMA1_CH2_BASE,  /*!< LPDMA1 Channel 2  */
  HAL_LPDMA1_CH3 = LPDMA1_CH3_BASE,  /*!< LPDMA1 Channel 3  */
#if defined(LPDMA1_CH4)
  HAL_LPDMA1_CH4 = LPDMA1_CH4_BASE,  /*!< LPDMA1 Channel 4  */
#endif /* LPDMA1_CH4 */
#if defined(LPDMA1_CH5)
  HAL_LPDMA1_CH5 = LPDMA1_CH5_BASE,  /*!< LPDMA1 Channel 5  */
#endif /* LPDMA1_CH5 */
#if defined(LPDMA1_CH6)
  HAL_LPDMA1_CH6 = LPDMA1_CH6_BASE,  /*!< LPDMA1 Channel 6  */
#endif /* LPDMA1_CH6 */
#if defined(LPDMA1_CH7)
  HAL_LPDMA1_CH7 = LPDMA1_CH7_BASE,  /*!< LPDMA1 Channel 7  */
#endif /* LPDMA1_CH7 */

#if defined(LPDMA2)
  /* LPDMA2 channel instances */
  HAL_LPDMA2_CH0 = LPDMA2_CH0_BASE,  /*!< LPDMA2 Channel 0 */
  HAL_LPDMA2_CH1 = LPDMA2_CH1_BASE,  /*!< LPDMA2 Channel 1 */
  HAL_LPDMA2_CH2 = LPDMA2_CH2_BASE,  /*!< LPDMA2 Channel 2 */
  HAL_LPDMA2_CH3 = LPDMA2_CH3_BASE,  /*!< LPDMA2 Channel 3 */
#if defined(LPDMA2_CH4)
  HAL_LPDMA2_CH4 = LPDMA2_CH4_BASE,  /*!< LPDMA2 Channel 4  */
#endif /* LPDMA2_CH4 */
#if defined(LPDMA2_CH5)
  HAL_LPDMA2_CH5 = LPDMA2_CH5_BASE,  /*!< LPDMA2 Channel 5  */
#endif /* LPDMA2_CH5 */
#if defined(LPDMA2_CH6)
  HAL_LPDMA2_CH6 = LPDMA2_CH6_BASE,  /*!< LPDMA2 Channel 6  */
#endif /* LPDMA2_CH6 */
#if defined(LPDMA2_CH7)
  HAL_LPDMA2_CH7 = LPDMA2_CH7_BASE   /*!< LPDMA2 Channel 7  */
#endif /* LPDMA2_CH7 */
#endif /* LPDMA2 */
} hal_dma_channel_t;

/*! DMA channel state enumeration definition */
typedef enum
{
  HAL_DMA_STATE_RESET   = 0U,        /*!< DMA channel not initialized                    */
  HAL_DMA_STATE_INIT    = 1U << 31U, /*!< DMA channel initialized but not yet configured */
  HAL_DMA_STATE_IDLE    = 1U << 30U, /*!< DMA channel initialized and configured         */
  HAL_DMA_STATE_ACTIVE  = 1U << 29U, /*!< DMA channel transfer is ongoing                */
  HAL_DMA_STATE_SUSPEND = 1U << 28U, /*!< DMA channel transfer suspended                 */
  HAL_DMA_STATE_ABORT   = 1U << 27U  /*!< DMA channel transfer aborted                   */
} hal_dma_state_t;

