MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dma.h
/*! HAL DMA channel transfer level completion enumeration definition */
typedef enum
{
  HAL_DMA_XFER_FULL_COMPLETE = LL_DMA_FLAG_IDLE,                 /*!< Full channel transfer */
  HAL_DMA_XFER_HALF_COMPLETE = LL_DMA_FLAG_HT | LL_DMA_FLAG_IDLE /*!< Half channel transfer */
} hal_dma_xfer_level_t;

#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
/*! DMA xfer mode enumeration definition */
typedef enum
{
  HAL_DMA_XFER_MODE_DIRECT              = 0x00U, /*!< DMA direct mode               */
  HAL_DMA_XFER_MODE_LINKEDLIST_LINEAR   = 0x01U, /*!< DMA linked list linear mode   */
  HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR = 0x02U  /*!< DMA linked list circular mode */
} hal_dma_xfer_mode_t;
#endif /* USE_HAL_DMA_LINKEDLIST */

/*! HAL DMA channel requests enumeration definition */
typedef enum
{
  /* LPDMA1 requests */
  HAL_LPDMA1_REQUEST_ADC1          = LL_LPDMA1_REQUEST_ADC1,         /*!< LPDMA1 HW request is ADC1         */
#if defined(ADC2)
  HAL_LPDMA1_REQUEST_ADC2          = LL_LPDMA1_REQUEST_ADC2,         /*!< LPDMA1 HW request is ADC2         */
#endif /* ADC2 */
  HAL_LPDMA1_REQUEST_TIM6_UPD      = LL_LPDMA1_REQUEST_TIM6_UPD,     /*!< LPDMA1 HW request is TIM6_UPD     */
  HAL_LPDMA1_REQUEST_TIM7_UPD      = LL_LPDMA1_REQUEST_TIM7_UPD,     /*!< LPDMA1 HW request is TIM7_UPD     */
  HAL_LPDMA1_REQUEST_SPI1_RX       = LL_LPDMA1_REQUEST_SPI1_RX,      /*!< LPDMA1 HW request is SPI1_RX      */
  HAL_LPDMA1_REQUEST_SPI1_TX       = LL_LPDMA1_REQUEST_SPI1_TX,      /*!< LPDMA1 HW request is SPI1_TX      */
  HAL_LPDMA1_REQUEST_SPI2_RX       = LL_LPDMA1_REQUEST_SPI2_RX,      /*!< LPDMA1 HW request is SPI2_RX      */
  HAL_LPDMA1_REQUEST_SPI2_TX       = LL_LPDMA1_REQUEST_SPI2_TX,      /*!< LPDMA1 HW request is SPI2_TX      */
#if defined(SPI3)
  HAL_LPDMA1_REQUEST_SPI3_RX       = LL_LPDMA1_REQUEST_SPI3_RX,      /*!< LPDMA1 HW request is SPI3_RX      */
  HAL_LPDMA1_REQUEST_SPI3_TX       = LL_LPDMA1_REQUEST_SPI3_TX,      /*!< LPDMA1 HW request is SPI3_TX      */
#endif /* SPI3 */
  HAL_LPDMA1_REQUEST_I2C1_RX       = LL_LPDMA1_REQUEST_I2C1_RX,      /*!< LPDMA1 HW request is I2C1_RX      */
  HAL_LPDMA1_REQUEST_I2C1_TX       = LL_LPDMA1_REQUEST_I2C1_TX,      /*!< LPDMA1 HW request is I2C1_TX      */
  HAL_LPDMA1_REQUEST_USART1_RX     = LL_LPDMA1_REQUEST_USART1_RX,    /*!< LPDMA1 HW request is USART1_RX    */
  HAL_LPDMA1_REQUEST_USART1_TX     = LL_LPDMA1_REQUEST_USART1_TX,    /*!< LPDMA1 HW request is USART1_TX    */
  HAL_LPDMA1_REQUEST_USART2_RX     = LL_LPDMA1_REQUEST_USART2_RX,    /*!< LPDMA1 HW request is USART2_RX    */
  HAL_LPDMA1_REQUEST_USART2_TX     = LL_LPDMA1_REQUEST_USART2_TX,    /*!< LPDMA1 HW request is USART2_TX    */
#if defined(USART3)
  HAL_LPDMA1_REQUEST_USART3_RX     = LL_LPDMA1_REQUEST_USART3_RX,    /*!< LPDMA1 HW request is USART3_RX    */
  HAL_LPDMA1_REQUEST_USART3_TX     = LL_LPDMA1_REQUEST_USART3_TX,    /*!< LPDMA1 HW request is USART3_TX    */
#endif /* USART3 */
  HAL_LPDMA1_REQUEST_UART4_RX      = LL_LPDMA1_REQUEST_UART4_RX,     /*!< LPDMA1 HW request is UART4_RX     */
  HAL_LPDMA1_REQUEST_UART4_TX      = LL_LPDMA1_REQUEST_UART4_TX,     /*!< LPDMA1 HW request is UART4_TX     */
  HAL_LPDMA1_REQUEST_UART5_RX      = LL_LPDMA1_REQUEST_UART5_RX,     /*!< LPDMA1 HW request is UART5_RX     */
  HAL_LPDMA1_REQUEST_UART5_TX      = LL_LPDMA1_REQUEST_UART5_TX,     /*!< LPDMA1 HW request is UART5_TX     */
  HAL_LPDMA1_REQUEST_LPUART1_RX    = LL_LPDMA1_REQUEST_LPUART1_RX,   /*!< LPDMA1 HW request is LPUART1_RX   */
  HAL_LPDMA1_REQUEST_LPUART1_TX    = LL_LPDMA1_REQUEST_LPUART1_TX,   /*!< LPDMA1 HW request is LPUART1_TX   */
  HAL_LPDMA1_REQUEST_TIM1_CC1      = LL_LPDMA1_REQUEST_TIM1_CC1,     /*!< LPDMA1 HW request is TIM1_CC1     */
  HAL_LPDMA1_REQUEST_TIM1_CC2      = LL_LPDMA1_REQUEST_TIM1_CC2,     /*!< LPDMA1 HW request is TIM1_CC2     */
  HAL_LPDMA1_REQUEST_TIM1_CC3      = LL_LPDMA1_REQUEST_TIM1_CC3,     /*!< LPDMA1 HW request is TIM1_CC3     */
  HAL_LPDMA1_REQUEST_TIM1_CC4      = LL_LPDMA1_REQUEST_TIM1_CC4,     /*!< LPDMA1 HW request is TIM1_CC4     */
  HAL_LPDMA1_REQUEST_TIM1_UPD      = LL_LPDMA1_REQUEST_TIM1_UPD,     /*!< LPDMA1 HW request is TIM1_UPD     */
  HAL_LPDMA1_REQUEST_TIM1_TRGI     = LL_LPDMA1_REQUEST_TIM1_TRGI,    /*!< LPDMA1 HW request is TIM1_TRGI    */
  HAL_LPDMA1_REQUEST_TIM1_COM      = LL_LPDMA1_REQUEST_TIM1_COM,     /*!< LPDMA1 HW request is TIM1_COM     */
  HAL_LPDMA1_REQUEST_TIM2_CC1      = LL_LPDMA1_REQUEST_TIM2_CC1,     /*!< LPDMA1 HW request is TIM2_CC1     */
  HAL_LPDMA1_REQUEST_TIM2_CC2      = LL_LPDMA1_REQUEST_TIM2_CC2,     /*!< LPDMA1 HW request is TIM2_CC2     */
  HAL_LPDMA1_REQUEST_TIM2_CC3      = LL_LPDMA1_REQUEST_TIM2_CC3,     /*!< LPDMA1 HW request is TIM2_CC3     */
  HAL_LPDMA1_REQUEST_TIM2_CC4      = LL_LPDMA1_REQUEST_TIM2_CC4,     /*!< LPDMA1 HW request is TIM2_CC4     */
  HAL_LPDMA1_REQUEST_TIM2_UPD      = LL_LPDMA1_REQUEST_TIM2_UPD,     /*!< LPDMA1 HW request is TIM2_UPD     */
  HAL_LPDMA1_REQUEST_TIM2_TRGI     = LL_LPDMA1_REQUEST_TIM2_TRGI,    /*!< LPDMA1 HW request is TIM2_TRGI    */
#if defined(TIM5)
  HAL_LPDMA1_REQUEST_TIM5_CC1      = LL_LPDMA1_REQUEST_TIM5_CC1,     /*!< LPDMA1 HW request is TIM5_CC1     */
  HAL_LPDMA1_REQUEST_TIM5_CC2      = LL_LPDMA1_REQUEST_TIM5_CC2,     /*!< LPDMA1 HW request is TIM5_CC2     */
  HAL_LPDMA1_REQUEST_TIM5_CC3      = LL_LPDMA1_REQUEST_TIM5_CC3,     /*!< LPDMA1 HW request is TIM5_CC3     */
  HAL_LPDMA1_REQUEST_TIM5_CC4      = LL_LPDMA1_REQUEST_TIM5_CC4,     /*!< LPDMA1 HW request is TIM5_CC4     */
  HAL_LPDMA1_REQUEST_TIM5_UPD      = LL_LPDMA1_REQUEST_TIM5_UPD,     /*!< LPDMA1 HW request is TIM5_UPD     */
  HAL_LPDMA1_REQUEST_TIM5_TRGI     = LL_LPDMA1_REQUEST_TIM5_TRGI,    /*!< LPDMA1 HW request is TIM5_TRGI    */
#endif /* TIM5 */
  HAL_LPDMA1_REQUEST_TIM15_CC1     = LL_LPDMA1_REQUEST_TIM15_CC1,    /*!< LPDMA1 HW request is TIM15_CC1    */
  HAL_LPDMA1_REQUEST_TIM15_CC2     = LL_LPDMA1_REQUEST_TIM15_CC2,    /*!< LPDMA1 HW request is TIM15_CC2    */
  HAL_LPDMA1_REQUEST_TIM15_UPD     = LL_LPDMA1_REQUEST_TIM15_UPD,    /*!< LPDMA1 HW request is TIM15_UPD    */
  HAL_LPDMA1_REQUEST_TIM15_TRGI    = LL_LPDMA1_REQUEST_TIM15_TRGI,   /*!< LPDMA1 HW request is TIM15_TRGI   */
  HAL_LPDMA1_REQUEST_TIM15_COM     = LL_LPDMA1_REQUEST_TIM15_COM,    /*!< LPDMA1 HW request is TIM15_COM    */
#if defined(TIM16)
  HAL_LPDMA1_REQUEST_TIM16_CC1     = LL_LPDMA1_REQUEST_TIM16_CC1,    /*!< LPDMA1 HW request is TIM16_CC1    */
  HAL_LPDMA1_REQUEST_TIM16_UPD     = LL_LPDMA1_REQUEST_TIM16_UPD,    /*!< LPDMA1 HW request is TIM16_UPD    */
#endif /* TIM16 */
#if defined(TIM17)
  HAL_LPDMA1_REQUEST_TIM17_CC1     = LL_LPDMA1_REQUEST_TIM17_CC1,    /*!< LPDMA1 HW request is TIM17_CC1    */
  HAL_LPDMA1_REQUEST_TIM17_UPD     = LL_LPDMA1_REQUEST_TIM17_UPD,    /*!< LPDMA1 HW request is TIM17_UPD    */
#endif /* TIM17 */
#if defined(LPTIM1)
  HAL_LPDMA1_REQUEST_LPTIM1_IC1    = LL_LPDMA1_REQUEST_LPTIM1_IC1,   /*!< LPDMA1 HW request is LPTIM1_IC1   */
  HAL_LPDMA1_REQUEST_LPTIM1_IC2    = LL_LPDMA1_REQUEST_LPTIM1_IC2,   /*!< LPDMA1 HW request is LPTIM1_IC2   */
  HAL_LPDMA1_REQUEST_LPTIM1_UE     = LL_LPDMA1_REQUEST_LPTIM1_UE,    /*!< LPDMA1 HW request is LPTIM1_UE    */
#endif /* LPTIM1 */
  HAL_LPDMA1_REQUEST_CORDIC_RD     = LL_LPDMA1_REQUEST_CORDIC_RD,    /*!< LPDMA1 HW request is CORDIC_RD    */
  HAL_LPDMA1_REQUEST_CORDIC_WR     = LL_LPDMA1_REQUEST_CORDIC_WR,    /*!< LPDMA1 HW request is CORDIC_WR    */
  HAL_LPDMA1_REQUEST_I3C1_RX       = LL_LPDMA1_REQUEST_I3C1_RX,      /*!< LPDMA1 HW request is I3C1_RX      */
  HAL_LPDMA1_REQUEST_I3C1_TX       = LL_LPDMA1_REQUEST_I3C1_TX,      /*!< LPDMA1 HW request is I3C1_TX      */
  HAL_LPDMA1_REQUEST_I3C1_TC       = LL_LPDMA1_REQUEST_I3C1_TC,      /*!< LPDMA1 HW request is I3C1_TC      */
  HAL_LPDMA1_REQUEST_I3C1_RS       = LL_LPDMA1_REQUEST_I3C1_RS,      /*!< LPDMA1 HW request is I3C1_RS      */
  HAL_LPDMA1_REQUEST_AES_OUT       = LL_LPDMA1_REQUEST_AES_OUT,      /*!< LPDMA1 HW request is AES_OUT      */
  HAL_LPDMA1_REQUEST_AES_IN        = LL_LPDMA1_REQUEST_AES_IN,       /*!< LPDMA1 HW request is AES_IN       */
  HAL_LPDMA1_REQUEST_HASH_IN       = LL_LPDMA1_REQUEST_HASH_IN,      /*!< LPDMA1 HW request is HASH_IN      */
#if defined(I2C2)
  HAL_LPDMA1_REQUEST_I2C2_RX       = LL_LPDMA1_REQUEST_I2C2_RX,      /*!< LPDMA1 HW request is I2C2_RX      */
  HAL_LPDMA1_REQUEST_I2C2_TX       = LL_LPDMA1_REQUEST_I2C2_TX,      /*!< LPDMA1 HW request is I2C2_TX      */
#endif /* I2C2 */
  HAL_LPDMA1_REQUEST_TIM8_CC1      = LL_LPDMA1_REQUEST_TIM8_CC1,     /*!< LPDMA1 HW request is TIM8_CC1     */
  HAL_LPDMA1_REQUEST_TIM8_CC2      = LL_LPDMA1_REQUEST_TIM8_CC2,     /*!< LPDMA1 HW request is TIM8_CC2     */
  HAL_LPDMA1_REQUEST_TIM8_CC3      = LL_LPDMA1_REQUEST_TIM8_CC3,     /*!< LPDMA1 HW request is TIM8_CC3     */
  HAL_LPDMA1_REQUEST_TIM8_CC4      = LL_LPDMA1_REQUEST_TIM8_CC4,     /*!< LPDMA1 HW request is TIM8_CC4     */
  HAL_LPDMA1_REQUEST_TIM8_UPD      = LL_LPDMA1_REQUEST_TIM8_UPD,     /*!< LPDMA1 HW request is TIM8_UPD     */
  HAL_LPDMA1_REQUEST_TIM8_TRGI     = LL_LPDMA1_REQUEST_TIM8_TRGI,    /*!< LPDMA1 HW request is TIM8_TRGI    */
  HAL_LPDMA1_REQUEST_TIM8_COM      = LL_LPDMA1_REQUEST_TIM8_COM,     /*!< LPDMA1 HW request is TIM8_COM     */
  HAL_LPDMA1_REQUEST_DAC1_CH1      = LL_LPDMA1_REQUEST_DAC1_CH1,     /*!< LPDMA1 HW request is DAC1_CH1     */
#if defined(DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2UL)
  HAL_LPDMA1_REQUEST_DAC1_CH2      = LL_LPDMA1_REQUEST_DAC1_CH2,     /*!< LPDMA1 HW request is DAC1_CH2     */
#endif /* DAC_NB_OF_CHANNEL == 2UL */
#if defined(USART6)
  HAL_LPDMA1_REQUEST_USART6_RX     = LL_LPDMA1_REQUEST_USART6_RX,    /*!< LPDMA1 HW request is USART6_RX    */
  HAL_LPDMA1_REQUEST_USART6_TX     = LL_LPDMA1_REQUEST_USART6_TX,    /*!< LPDMA1 HW request is USART6_TX    */
#endif /* USART6 */
#if defined(UART7)
  HAL_LPDMA1_REQUEST_UART7_TX      = LL_LPDMA1_REQUEST_UART7_TX,     /*!< LPDMA1 HW request is UART7_TX     */
  HAL_LPDMA1_REQUEST_UART7_RX      = LL_LPDMA1_REQUEST_UART7_RX,     /*!< LPDMA1 HW request is UART7_RX     */
#endif /* UART7 */
#if defined(ADC3)
  HAL_LPDMA1_REQUEST_ADC3          = LL_LPDMA1_REQUEST_ADC3,         /*!< LPDMA1 HW request is ADC3         */
#endif /* ADC3 */
#if defined(TIM3)
  HAL_LPDMA1_REQUEST_TIM3_CC1      = LL_LPDMA1_REQUEST_TIM3_CC1,     /*!< LPDMA1 HW request is TIM3_CC1     */
  HAL_LPDMA1_REQUEST_TIM3_CC2      = LL_LPDMA1_REQUEST_TIM3_CC2,     /*!< LPDMA1 HW request is TIM3_CC2     */
  HAL_LPDMA1_REQUEST_TIM3_CC3      = LL_LPDMA1_REQUEST_TIM3_CC3,     /*!< LPDMA1 HW request is TIM3_CC3     */
  HAL_LPDMA1_REQUEST_TIM3_CC4      = LL_LPDMA1_REQUEST_TIM3_CC4,     /*!< LPDMA1 HW request is TIM3_CC4     */
  HAL_LPDMA1_REQUEST_TIM3_UPD      = LL_LPDMA1_REQUEST_TIM3_UPD,     /*!< LPDMA1 HW request is TIM3_UPD     */
  HAL_LPDMA1_REQUEST_TIM3_TRGI     = LL_LPDMA1_REQUEST_TIM3_TRGI,    /*!< LPDMA1 HW request is TIM3_TRGI    */
#endif /* TIM3 */
#if defined(TIM4)
  HAL_LPDMA1_REQUEST_TIM4_CC1      = LL_LPDMA1_REQUEST_TIM4_CC1,     /*!< LPDMA1 HW request is TIM4_CC1     */
  HAL_LPDMA1_REQUEST_TIM4_CC2      = LL_LPDMA1_REQUEST_TIM4_CC2,     /*!< LPDMA1 HW request is TIM4_CC2     */
  HAL_LPDMA1_REQUEST_TIM4_CC3      = LL_LPDMA1_REQUEST_TIM4_CC3,     /*!< LPDMA1 HW request is TIM4_CC3     */
  HAL_LPDMA1_REQUEST_TIM4_CC4      = LL_LPDMA1_REQUEST_TIM4_CC4,     /*!< LPDMA1 HW request is TIM4_CC4     */
  HAL_LPDMA1_REQUEST_TIM4_UPD      = LL_LPDMA1_REQUEST_TIM4_UPD,     /*!< LPDMA1 HW request is TIM4_UPD     */
  HAL_LPDMA1_REQUEST_TIM4_TRGI     = LL_LPDMA1_REQUEST_TIM4_TRGI,    /*!< LPDMA1 HW request is TIM4_TRGI    */
#endif /* TIM4 */
#if defined(SAES)
  HAL_LPDMA1_REQUEST_SAES_OUT      = LL_LPDMA1_REQUEST_SAES_OUT,     /*!< LPDMA1 HW request is SAES_OUT     */
  HAL_LPDMA1_REQUEST_SAES_IN       = LL_LPDMA1_REQUEST_SAES_IN,      /*!< LPDMA1 HW request is SAES_IN      */
#endif /* SAES */
#if defined(XSPI1)
  HAL_LPDMA1_REQUEST_XSPI1         = LL_LPDMA1_REQUEST_XSPI1,        /*!< LPDMA1 HW request is XSPI1        */
#endif /* XSPI1 */

#if defined(LPDMA2)
  /* LPDMA2 requests */
  HAL_LPDMA2_REQUEST_ADC1          = LL_LPDMA2_REQUEST_ADC1,         /*!< LPDMA2 HW request is ADC1         */
#if defined(ADC2)
  HAL_LPDMA2_REQUEST_ADC2          = LL_LPDMA2_REQUEST_ADC2,         /*!< LPDMA2 HW request is ADC2         */
#endif /* ADC2 */
  HAL_LPDMA2_REQUEST_TIM6_UPD      = LL_LPDMA2_REQUEST_TIM6_UPD,     /*!< LPDMA2 HW request is TIM6_UPD     */
  HAL_LPDMA2_REQUEST_TIM7_UPD      = LL_LPDMA2_REQUEST_TIM7_UPD,     /*!< LPDMA2 HW request is TIM7_UPD     */
  HAL_LPDMA2_REQUEST_SPI1_RX       = LL_LPDMA2_REQUEST_SPI1_RX,      /*!< LPDMA2 HW request is SPI1_RX      */
  HAL_LPDMA2_REQUEST_SPI1_TX       = LL_LPDMA2_REQUEST_SPI1_TX,      /*!< LPDMA2 HW request is SPI1_TX      */
  HAL_LPDMA2_REQUEST_SPI2_RX       = LL_LPDMA2_REQUEST_SPI2_RX,      /*!< LPDMA2 HW request is SPI2_RX      */
  HAL_LPDMA2_REQUEST_SPI2_TX       = LL_LPDMA2_REQUEST_SPI2_TX,      /*!< LPDMA2 HW request is SPI2_TX      */
#if defined(SPI3)
  HAL_LPDMA2_REQUEST_SPI3_RX       = LL_LPDMA2_REQUEST_SPI3_RX,      /*!< LPDMA2 HW request is SPI3_RX      */
  HAL_LPDMA2_REQUEST_SPI3_TX       = LL_LPDMA2_REQUEST_SPI3_TX,      /*!< LPDMA2 HW request is SPI3_TX      */
#endif /* SPI3 */
  HAL_LPDMA2_REQUEST_I2C1_RX       = LL_LPDMA2_REQUEST_I2C1_RX,      /*!< LPDMA2 HW request is I2C1_RX      */
  HAL_LPDMA2_REQUEST_I2C1_TX       = LL_LPDMA2_REQUEST_I2C1_TX,      /*!< LPDMA2 HW request is I2C1_TX      */
  HAL_LPDMA2_REQUEST_USART1_RX     = LL_LPDMA2_REQUEST_USART1_RX,    /*!< LPDMA2 HW request is USART1_RX    */
  HAL_LPDMA2_REQUEST_USART1_TX     = LL_LPDMA2_REQUEST_USART1_TX,    /*!< LPDMA2 HW request is USART1_TX    */
  HAL_LPDMA2_REQUEST_USART2_RX     = LL_LPDMA2_REQUEST_USART2_RX,    /*!< LPDMA2 HW request is USART2_RX    */
  HAL_LPDMA2_REQUEST_USART2_TX     = LL_LPDMA2_REQUEST_USART2_TX,    /*!< LPDMA2 HW request is USART2_TX    */
#if defined(USART3)
  HAL_LPDMA2_REQUEST_USART3_RX     = LL_LPDMA2_REQUEST_USART3_RX,    /*!< LPDMA2 HW request is USART3_RX    */
  HAL_LPDMA2_REQUEST_USART3_TX     = LL_LPDMA2_REQUEST_USART3_TX,    /*!< LPDMA2 HW request is USART3_TX    */
#endif /* USART3 */
  HAL_LPDMA2_REQUEST_UART4_RX      = LL_LPDMA2_REQUEST_UART4_RX,     /*!< LPDMA2 HW request is UART4_RX     */
  HAL_LPDMA2_REQUEST_UART4_TX      = LL_LPDMA2_REQUEST_UART4_TX,     /*!< LPDMA2 HW request is UART4_TX     */
  HAL_LPDMA2_REQUEST_UART5_RX      = LL_LPDMA2_REQUEST_UART5_RX,     /*!< LPDMA2 HW request is UART5_RX     */
  HAL_LPDMA2_REQUEST_UART5_TX      = LL_LPDMA2_REQUEST_UART5_TX,     /*!< LPDMA2 HW request is UART5_TX     */
  HAL_LPDMA2_REQUEST_LPUART1_RX    = LL_LPDMA2_REQUEST_LPUART1_RX,   /*!< LPDMA2 HW request is LPUART1_RX   */
  HAL_LPDMA2_REQUEST_LPUART1_TX    = LL_LPDMA2_REQUEST_LPUART1_TX,   /*!< LPDMA2 HW request is LPUART1_TX   */
  HAL_LPDMA2_REQUEST_TIM1_CC1      = LL_LPDMA2_REQUEST_TIM1_CC1,     /*!< LPDMA2 HW request is TIM1_CC1     */
  HAL_LPDMA2_REQUEST_TIM1_CC2      = LL_LPDMA2_REQUEST_TIM1_CC2,     /*!< LPDMA2 HW request is TIM1_CC2     */
  HAL_LPDMA2_REQUEST_TIM1_CC3      = LL_LPDMA2_REQUEST_TIM1_CC3,     /*!< LPDMA2 HW request is TIM1_CC3     */
  HAL_LPDMA2_REQUEST_TIM1_CC4      = LL_LPDMA2_REQUEST_TIM1_CC4,     /*!< LPDMA2 HW request is TIM1_CC4     */
  HAL_LPDMA2_REQUEST_TIM1_UPD      = LL_LPDMA2_REQUEST_TIM1_UPD,     /*!< LPDMA2 HW request is TIM1_UPD     */
  HAL_LPDMA2_REQUEST_TIM1_TRGI     = LL_LPDMA2_REQUEST_TIM1_TRGI,    /*!< LPDMA2 HW request is TIM1_TRGI    */
  HAL_LPDMA2_REQUEST_TIM1_COM      = LL_LPDMA2_REQUEST_TIM1_COM,     /*!< LPDMA2 HW request is TIM1_COM     */
  HAL_LPDMA2_REQUEST_TIM2_CC1      = LL_LPDMA2_REQUEST_TIM2_CC1,     /*!< LPDMA2 HW request is TIM2_CC1     */
  HAL_LPDMA2_REQUEST_TIM2_CC2      = LL_LPDMA2_REQUEST_TIM2_CC2,     /*!< LPDMA2 HW request is TIM2_CC2     */
  HAL_LPDMA2_REQUEST_TIM2_CC3      = LL_LPDMA2_REQUEST_TIM2_CC3,     /*!< LPDMA2 HW request is TIM2_CC3     */
  HAL_LPDMA2_REQUEST_TIM2_CC4      = LL_LPDMA2_REQUEST_TIM2_CC4,     /*!< LPDMA2 HW request is TIM2_CC4     */
  HAL_LPDMA2_REQUEST_TIM2_UPD      = LL_LPDMA2_REQUEST_TIM2_UPD,     /*!< LPDMA2 HW request is TIM2_UPD     */
  HAL_LPDMA2_REQUEST_TIM2_TRGI     = LL_LPDMA2_REQUEST_TIM2_TRGI,    /*!< LPDMA2 HW request is TIM2_TRGI    */
#if defined(TIM5)
  HAL_LPDMA2_REQUEST_TIM5_CC1      = LL_LPDMA2_REQUEST_TIM5_CC1,     /*!< LPDMA2 HW request is TIM5_CC1     */
  HAL_LPDMA2_REQUEST_TIM5_CC2      = LL_LPDMA2_REQUEST_TIM5_CC2,     /*!< LPDMA2 HW request is TIM5_CC2     */
  HAL_LPDMA2_REQUEST_TIM5_CC3      = LL_LPDMA2_REQUEST_TIM5_CC3,     /*!< LPDMA2 HW request is TIM5_CC3     */
  HAL_LPDMA2_REQUEST_TIM5_CC4      = LL_LPDMA2_REQUEST_TIM5_CC4,     /*!< LPDMA2 HW request is TIM5_CC4     */
  HAL_LPDMA2_REQUEST_TIM5_UPD      = LL_LPDMA2_REQUEST_TIM5_UPD,     /*!< LPDMA2 HW request is TIM5_UPD     */
  HAL_LPDMA2_REQUEST_TIM5_TRGI     = LL_LPDMA2_REQUEST_TIM5_TRGI,    /*!< LPDMA2 HW request is TIM5_TRGI    */
#endif /* TIM5 */
  HAL_LPDMA2_REQUEST_TIM15_CC1     = LL_LPDMA2_REQUEST_TIM15_CC1,    /*!< LPDMA2 HW request is TIM15_CC1    */
  HAL_LPDMA2_REQUEST_TIM15_CC2     = LL_LPDMA2_REQUEST_TIM15_CC2,    /*!< LPDMA2 HW request is TIM15_CC2    */
  HAL_LPDMA2_REQUEST_TIM15_UPD     = LL_LPDMA2_REQUEST_TIM15_UPD,    /*!< LPDMA2 HW request is TIM15_UPD    */
  HAL_LPDMA2_REQUEST_TIM15_TRGI    = LL_LPDMA2_REQUEST_TIM15_TRGI,   /*!< LPDMA2 HW request is TIM15_TRGI   */
  HAL_LPDMA2_REQUEST_TIM15_COM     = LL_LPDMA2_REQUEST_TIM15_COM,    /*!< LPDMA2 HW request is TIM15_COM    */
#if defined(TIM16)
  HAL_LPDMA2_REQUEST_TIM16_CC1     = LL_LPDMA2_REQUEST_TIM16_CC1,    /*!< LPDMA2 HW request is TIM16_CC1    */
  HAL_LPDMA2_REQUEST_TIM16_UPD     = LL_LPDMA2_REQUEST_TIM16_UPD,    /*!< LPDMA2 HW request is TIM16_UPD    */
#endif /* TIM16 */
#if defined(TIM17)
  HAL_LPDMA2_REQUEST_TIM17_CC1     = LL_LPDMA2_REQUEST_TIM17_CC1,    /*!< LPDMA2 HW request is TIM17_CC1    */
  HAL_LPDMA2_REQUEST_TIM17_UPD     = LL_LPDMA2_REQUEST_TIM17_UPD,    /*!< LPDMA2 HW request is TIM17_UPD    */
#endif /* TIM17 */
#if defined(LPTIM1)
  HAL_LPDMA2_REQUEST_LPTIM1_IC1    = LL_LPDMA2_REQUEST_LPTIM1_IC1,   /*!< LPDMA2 HW request is LPTIM1_IC1   */
  HAL_LPDMA2_REQUEST_LPTIM1_IC2    = LL_LPDMA2_REQUEST_LPTIM1_IC2,   /*!< LPDMA2 HW request is LPTIM1_IC2   */
  HAL_LPDMA2_REQUEST_LPTIM1_UE     = LL_LPDMA2_REQUEST_LPTIM1_UE,    /*!< LPDMA2 HW request is LPTIM1_UE    */
#endif /* LPTIM1 */
  HAL_LPDMA2_REQUEST_CORDIC_RD     = LL_LPDMA2_REQUEST_CORDIC_RD,    /*!< LPDMA2 HW request is CORDIC_RD    */
  HAL_LPDMA2_REQUEST_CORDIC_WR     = LL_LPDMA2_REQUEST_CORDIC_WR,    /*!< LPDMA2 HW request is CORDIC_WR    */
  HAL_LPDMA2_REQUEST_I3C1_RX       = LL_LPDMA2_REQUEST_I3C1_RX,      /*!< LPDMA2 HW request is I3C1_RX      */
  HAL_LPDMA2_REQUEST_I3C1_TX       = LL_LPDMA2_REQUEST_I3C1_TX,      /*!< LPDMA2 HW request is I3C1_TX      */
  HAL_LPDMA2_REQUEST_I3C1_TC       = LL_LPDMA2_REQUEST_I3C1_TC,      /*!< LPDMA2 HW request is I3C1_TC      */
  HAL_LPDMA2_REQUEST_I3C1_RS       = LL_LPDMA2_REQUEST_I3C1_RS,      /*!< LPDMA2 HW request is I3C1_RS      */
  HAL_LPDMA2_REQUEST_AES_OUT       = LL_LPDMA2_REQUEST_AES_OUT,      /*!< LPDMA2 HW request is AES_OUT      */
  HAL_LPDMA2_REQUEST_AES_IN        = LL_LPDMA2_REQUEST_AES_IN,       /*!< LPDMA2 HW request is AES_IN       */
  HAL_LPDMA2_REQUEST_HASH_IN       = LL_LPDMA2_REQUEST_HASH_IN,      /*!< LPDMA2 HW request is HASH_IN      */
#if defined(I2C2)
  HAL_LPDMA2_REQUEST_I2C2_RX       = LL_LPDMA2_REQUEST_I2C2_RX,      /*!< LPDMA2 HW request is I2C2_RX      */
  HAL_LPDMA2_REQUEST_I2C2_TX       = LL_LPDMA2_REQUEST_I2C2_TX,      /*!< LPDMA2 HW request is I2C2_TX      */
#endif /* I2C2 */
  HAL_LPDMA2_REQUEST_TIM8_CC1      = LL_LPDMA2_REQUEST_TIM8_CC1,     /*!< LPDMA2 HW request is TIM8_CC1     */
  HAL_LPDMA2_REQUEST_TIM8_CC2      = LL_LPDMA2_REQUEST_TIM8_CC2,     /*!< LPDMA2 HW request is TIM8_CC2     */
  HAL_LPDMA2_REQUEST_TIM8_CC3      = LL_LPDMA2_REQUEST_TIM8_CC3,     /*!< LPDMA2 HW request is TIM8_CC3     */
  HAL_LPDMA2_REQUEST_TIM8_CC4      = LL_LPDMA2_REQUEST_TIM8_CC4,     /*!< LPDMA2 HW request is TIM8_CC4     */
  HAL_LPDMA2_REQUEST_TIM8_UPD      = LL_LPDMA2_REQUEST_TIM8_UPD,     /*!< LPDMA2 HW request is TIM8_UPD     */
  HAL_LPDMA2_REQUEST_TIM8_TRGI     = LL_LPDMA2_REQUEST_TIM8_TRGI,    /*!< LPDMA2 HW request is TIM8_TRGI    */
  HAL_LPDMA2_REQUEST_TIM8_COM      = LL_LPDMA2_REQUEST_TIM8_COM,     /*!< LPDMA2 HW request is TIM8_COM     */
  HAL_LPDMA2_REQUEST_DAC1_CH1      = LL_LPDMA2_REQUEST_DAC1_CH1,     /*!< LPDMA2 HW request is DAC1_CH1     */
#if defined(DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2UL)
  HAL_LPDMA2_REQUEST_DAC1_CH2      = LL_LPDMA2_REQUEST_DAC1_CH2,     /*!< LPDMA2 HW request is DAC1_CH2     */
#endif /* DAC_NB_OF_CHANNEL == 2UL */
#if defined(USART6)
  HAL_LPDMA2_REQUEST_USART6_RX     = LL_LPDMA2_REQUEST_USART6_RX,    /*!< LPDMA2 HW request is USART6_RX    */
  HAL_LPDMA2_REQUEST_USART6_TX     = LL_LPDMA2_REQUEST_USART6_TX,    /*!< LPDMA2 HW request is USART6_TX    */
#endif /* USART6 */
#if defined(UART7)
  HAL_LPDMA2_REQUEST_UART7_TX      = LL_LPDMA2_REQUEST_UART7_TX,     /*!< LPDMA2 HW request is UART7_TX     */
  HAL_LPDMA2_REQUEST_UART7_RX      = LL_LPDMA2_REQUEST_UART7_RX,     /*!< LPDMA2 HW request is UART7_RX     */
#endif /* UART7 */
#if defined(ADC3)
  HAL_LPDMA2_REQUEST_ADC3          = LL_LPDMA2_REQUEST_ADC3,         /*!< LPDMA2 HW request is ADC3         */
#endif /* ADC3 */
#if defined(TIM3)
  HAL_LPDMA2_REQUEST_TIM3_CC1      = LL_LPDMA2_REQUEST_TIM3_CC1,     /*!< LPDMA2 HW request is TIM3_CC1     */
  HAL_LPDMA2_REQUEST_TIM3_CC2      = LL_LPDMA2_REQUEST_TIM3_CC2,     /*!< LPDMA2 HW request is TIM3_CC2     */
  HAL_LPDMA2_REQUEST_TIM3_CC3      = LL_LPDMA2_REQUEST_TIM3_CC3,     /*!< LPDMA2 HW request is TIM3_CC3     */
  HAL_LPDMA2_REQUEST_TIM3_CC4      = LL_LPDMA2_REQUEST_TIM3_CC4,     /*!< LPDMA2 HW request is TIM3_CC4     */
  HAL_LPDMA2_REQUEST_TIM3_UPD      = LL_LPDMA2_REQUEST_TIM3_UPD,     /*!< LPDMA2 HW request is TIM3_UPD     */
  HAL_LPDMA2_REQUEST_TIM3_TRGI     = LL_LPDMA2_REQUEST_TIM3_TRGI,    /*!< LPDMA2 HW request is TIM3_TRGI    */
#endif /* TIM3 */
#if defined(TIM4)
  HAL_LPDMA2_REQUEST_TIM4_CC1      = LL_LPDMA2_REQUEST_TIM4_CC1,     /*!< LPDMA2 HW request is TIM4_CC1     */
  HAL_LPDMA2_REQUEST_TIM4_CC2      = LL_LPDMA2_REQUEST_TIM4_CC2,     /*!< LPDMA2 HW request is TIM4_CC2     */
  HAL_LPDMA2_REQUEST_TIM4_CC3      = LL_LPDMA2_REQUEST_TIM4_CC3,     /*!< LPDMA2 HW request is TIM4_CC3     */
  HAL_LPDMA2_REQUEST_TIM4_CC4      = LL_LPDMA2_REQUEST_TIM4_CC4,     /*!< LPDMA2 HW request is TIM4_CC4     */
  HAL_LPDMA2_REQUEST_TIM4_UPD      = LL_LPDMA2_REQUEST_TIM4_UPD,     /*!< LPDMA2 HW request is TIM4_UPD     */
  HAL_LPDMA2_REQUEST_TIM4_TRGI     = LL_LPDMA2_REQUEST_TIM4_TRGI,    /*!< LPDMA2 HW request is TIM4_TRGI    */
#endif /* TIM4 */
#if defined(SAES)
  HAL_LPDMA2_REQUEST_SAES_OUT      = LL_LPDMA2_REQUEST_SAES_OUT,     /*!< LPDMA2 HW request is SAES_OUT     */
  HAL_LPDMA2_REQUEST_SAES_IN       = LL_LPDMA2_REQUEST_SAES_IN,      /*!< LPDMA2 HW request is SAES_IN      */
#endif /* SAES */
#if defined(XSPI1)
  HAL_LPDMA2_REQUEST_XSPI1         = LL_LPDMA2_REQUEST_XSPI1,        /*!< LPDMA2 HW request is XSPI1        */
#endif /* XSPI1 */
#endif /* LPDMA2 */

  /* Software request */
  HAL_DMA_REQUEST_SW               = DMA_CTR2_SWREQ                  /*!< DMA SW request                    */
} hal_dma_request_source_t;

