MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dma.h
/*! DMA channel mode enumeration definition */
typedef enum
{
  HAL_DMA_HARDWARE_REQUEST_BURST = LL_DMA_HARDWARE_REQUEST_BURST, /*!< DMA burst request transfer */
  HAL_DMA_HARDWARE_REQUEST_BLOCK = LL_DMA_HARDWARE_REQUEST_BLOCK  /*!< DMA block request transfer */
} hal_dma_hardware_request_mode_t;

/*! DMA channel direction enumeration definition */
typedef enum
{
  HAL_DMA_DIRECTION_MEMORY_TO_MEMORY = LL_DMA_DIRECTION_MEMORY_TO_MEMORY, /*!< Memory to memory direction     */
  HAL_DMA_DIRECTION_PERIPH_TO_MEMORY = LL_DMA_DIRECTION_PERIPH_TO_MEMORY, /*!< Peripheral to memory direction */
  HAL_DMA_DIRECTION_MEMORY_TO_PERIPH = LL_DMA_DIRECTION_MEMORY_TO_PERIPH  /*!< Memory to peripheral direction */
} hal_dma_direction_t;

/*! DMA channel source increment enumeration definition */
typedef enum
{
  HAL_DMA_SRC_ADDR_FIXED       = LL_DMA_SRC_ADDR_FIXED,       /*!< Source fixed single / burst       */
  HAL_DMA_SRC_ADDR_INCREMENTED = LL_DMA_SRC_ADDR_INCREMENTED  /*!< Source incremented single / burst */
} hal_dma_src_addr_increment_t;

/*! DMA channel destination increment enumeration definition */
typedef enum
{
  HAL_DMA_DEST_ADDR_FIXED       = LL_DMA_DEST_ADDR_FIXED,       /*!< Destination fixed single / burst       */
  HAL_DMA_DEST_ADDR_INCREMENTED = LL_DMA_DEST_ADDR_INCREMENTED  /*!< Destination incremented single / burst */
} hal_dma_dest_addr_increment_t;

/*! DMA channel source data width enumeration definition */
typedef enum
{
  HAL_DMA_SRC_DATA_WIDTH_BYTE       = LL_DMA_SRC_DATA_WIDTH_BYTE,      /*!< Source data width: byte        */
  HAL_DMA_SRC_DATA_WIDTH_HALFWORD   = LL_DMA_SRC_DATA_WIDTH_HALFWORD,  /*!< Source data width: halfword    */
  HAL_DMA_SRC_DATA_WIDTH_WORD       = LL_DMA_SRC_DATA_WIDTH_WORD,      /*!< Source data width: word        */
} hal_dma_src_data_width_t;

/*! DMA channel destination data width enumeration definition */
typedef enum
{
  HAL_DMA_DEST_DATA_WIDTH_BYTE       = LL_DMA_DEST_DATA_WIDTH_BYTE,      /*!< Destination data width: byte        */
  HAL_DMA_DEST_DATA_WIDTH_HALFWORD   = LL_DMA_DEST_DATA_WIDTH_HALFWORD,  /*!< Destination data width: halfword    */
  HAL_DMA_DEST_DATA_WIDTH_WORD       = LL_DMA_DEST_DATA_WIDTH_WORD,      /*!< Destination data width: word        */
} hal_dma_dest_data_width_t;

/*! DMA channel priority enumeration definition */
typedef enum
{
  HAL_DMA_PRIORITY_LOW_WEIGHT_LOW  = LL_DMA_PRIORITY_LOW_WEIGHT_LOW,  /*!< Priority level: low priority, low weight   */
  HAL_DMA_PRIORITY_LOW_WEIGHT_MID  = LL_DMA_PRIORITY_LOW_WEIGHT_MID,  /*!< Priority level: low priority, mid weight   */
  HAL_DMA_PRIORITY_LOW_WEIGHT_HIGH = LL_DMA_PRIORITY_LOW_WEIGHT_HIGH, /*!< Priority level: low priority, high weight  */
  HAL_DMA_PRIORITY_HIGH            = LL_DMA_PRIORITY_HIGH             /*!< Priority level: high priority              */
} hal_dma_priority_t;

/*! DMA channel transfer configuration structure definition */
typedef struct
{
  hal_dma_request_source_t      request;         /*!< DMA channel transfer request           */
  hal_dma_direction_t           direction;       /*!< DMA channel transfer direction         */
  hal_dma_src_addr_increment_t  src_inc;         /*!< DMA channel source increment mode      */
  hal_dma_dest_addr_increment_t dest_inc;        /*!< DMA channel destination increment mode */
  hal_dma_src_data_width_t      src_data_width;  /*!< DMA channel source data width          */
  hal_dma_dest_data_width_t     dest_data_width; /*!< DMA channel destination data width     */
  hal_dma_priority_t            priority;        /*!< DMA channel priority level             */
} hal_dma_direct_xfer_config_t;

/*! DMA channel flow control mode enumeration definition */
typedef enum
{
  HAL_DMA_FLOW_CONTROL_DMA    = LL_DMA_FLOW_CONTROL_DMA,    /*!< DMA request DMA channel flow control */
  HAL_DMA_FLOW_CONTROL_PERIPH = LL_DMA_FLOW_CONTROL_PERIPH  /*!< DMA request peripheral flow control  */
} hal_dma_flow_control_mode_t;

/*! HAL DMA channel trigger hardware signal enumeration definition */
typedef enum
{
  /* LPDMA1 triggers */
  HAL_LPDMA1_TRIGGER_EXTI0         = LL_LPDMA1_TRIGGER_EXTI0,          /*!< LPDMA1 HW Trigger is EXTI0         */
  HAL_LPDMA1_TRIGGER_EXTI1         = LL_LPDMA1_TRIGGER_EXTI1,          /*!< LPDMA1 HW Trigger is EXTI1         */
  HAL_LPDMA1_TRIGGER_EXTI2         = LL_LPDMA1_TRIGGER_EXTI2,          /*!< LPDMA1 HW Trigger is EXTI2         */
  HAL_LPDMA1_TRIGGER_EXTI3         = LL_LPDMA1_TRIGGER_EXTI3,          /*!< LPDMA1 HW Trigger is EXTI3         */
  HAL_LPDMA1_TRIGGER_EXTI4         = LL_LPDMA1_TRIGGER_EXTI4,          /*!< LPDMA1 HW Trigger is EXTI4         */
  HAL_LPDMA1_TRIGGER_EXTI5         = LL_LPDMA1_TRIGGER_EXTI5,          /*!< LPDMA1 HW Trigger is EXTI5         */
  HAL_LPDMA1_TRIGGER_EXTI6         = LL_LPDMA1_TRIGGER_EXTI6,          /*!< LPDMA1 HW Trigger is EXTI6         */
  HAL_LPDMA1_TRIGGER_EXTI7         = LL_LPDMA1_TRIGGER_EXTI7,          /*!< LPDMA1 HW Trigger is EXTI7         */
  HAL_LPDMA1_TRIGGER_TAMP_TRG1     = LL_LPDMA1_TRIGGER_TAMP_TRG1,      /*!< LPDMA1 HW Trigger is TAMP_TRG1     */
  HAL_LPDMA1_TRIGGER_TAMP_TRG2     = LL_LPDMA1_TRIGGER_TAMP_TRG2,      /*!< LPDMA1 HW Trigger is TAMP_TRG2     */
  HAL_LPDMA1_TRIGGER_TAMP_TRG3     = LL_LPDMA1_TRIGGER_TAMP_TRG3,      /*!< LPDMA1 HW Trigger is TAMP_TRG3     */
#if defined(LPTIM1)
  HAL_LPDMA1_TRIGGER_LPTIM1_CH1    = LL_LPDMA1_TRIGGER_LPTIM1_CH1,     /*!< LPDMA1 HW Trigger is LPTIM1_CH1    */
  HAL_LPDMA1_TRIGGER_LPTIM1_CH2    = LL_LPDMA1_TRIGGER_LPTIM1_CH2,     /*!< LPDMA1 HW Trigger is LPTIM1_CH2    */
#endif /* LPTIM1 */
  HAL_LPDMA1_TRIGGER_RTC_ALRA_TRG  = LL_LPDMA1_TRIGGER_RTC_ALRA_TRG,   /*!< LPDMA1 HW Trigger is RTC_ALRA_TRG  */
  HAL_LPDMA1_TRIGGER_RTC_ALRB_TRG  = LL_LPDMA1_TRIGGER_RTC_ALRB_TRG,   /*!< LPDMA1 HW Trigger is RTC_ALRB_TRG  */
  HAL_LPDMA1_TRIGGER_RTC_WUT_TRG   = LL_LPDMA1_TRIGGER_RTC_WUT_TRG,    /*!< LPDMA1 HW Trigger is RTC_WUT_TRG   */
  HAL_LPDMA1_TRIGGER_TIM2_TRGO     = LL_LPDMA1_TRIGGER_TIM2_TRGO,      /*!< LPDMA1 HW Trigger is TIM2_TRGO     */
  HAL_LPDMA1_TRIGGER_TIM15_TRGO    = LL_LPDMA1_TRIGGER_TIM15_TRGO,     /*!< LPDMA1 HW Trigger is TIM15_TRGO    */
  HAL_LPDMA1_TRIGGER_COMP1_OUT     = LL_LPDMA1_TRIGGER_COMP1_OUT,      /*!< LPDMA1 HW Trigger is COMP1_OUT     */
  HAL_LPDMA1_TRIGGER_EVENTOUT      = LL_LPDMA1_TRIGGER_EVENTOUT,       /*!< LPDMA1 HW Trigger is EVENTOUT      */
  HAL_LPDMA1_TRIGGER_LPDMA1_CH0_TC = LL_LPDMA1_TRIGGER_LPDMA1_CH0_TC,  /*!< LPDMA1 HW Trigger is LPDMA1_CH0_TC */
  HAL_LPDMA1_TRIGGER_LPDMA1_CH1_TC = LL_LPDMA1_TRIGGER_LPDMA1_CH1_TC,  /*!< LPDMA1 HW Trigger is LPDMA1_CH1_TC */
  HAL_LPDMA1_TRIGGER_LPDMA1_CH2_TC = LL_LPDMA1_TRIGGER_LPDMA1_CH2_TC,  /*!< LPDMA1 HW Trigger is LPDMA1_CH2_TC */
  HAL_LPDMA1_TRIGGER_LPDMA1_CH3_TC = LL_LPDMA1_TRIGGER_LPDMA1_CH3_TC,  /*!< LPDMA1 HW Trigger is LPDMA1_CH3_TC */
#if defined (LPDMA1_CH4)
  HAL_LPDMA1_TRIGGER_LPDMA1_CH4_TC = LL_LPDMA1_TRIGGER_LPDMA1_CH4_TC,  /*!< LPDMA1 HW Trigger is LPDMA1_CH4_TC */
#endif /* LPDMA1_CH4 */
#if defined (LPDMA1_CH5)
  HAL_LPDMA1_TRIGGER_LPDMA1_CH5_TC = LL_LPDMA1_TRIGGER_LPDMA1_CH5_TC,  /*!< LPDMA1 HW Trigger is LPDMA1_CH5_TC */
#endif /* LPDMA1_CH5 */
#if defined (LPDMA1_CH6)
  HAL_LPDMA1_TRIGGER_LPDMA1_CH6_TC = LL_LPDMA1_TRIGGER_LPDMA1_CH6_TC,  /*!< LPDMA1 HW Trigger is LPDMA1_CH6_TC */
#endif /* LPDMA1_CH6 */
#if defined (LPDMA1_CH7)
  HAL_LPDMA1_TRIGGER_LPDMA1_CH7_TC = LL_LPDMA1_TRIGGER_LPDMA1_CH7_TC,  /*!< LPDMA1 HW Trigger is LPDMA1_CH7_TC */
#endif /* LPDMA1_CH7 */
#if defined(LPDMA2)
  HAL_LPDMA1_TRIGGER_LPDMA2_CH0_TC = LL_LPDMA1_TRIGGER_LPDMA2_CH0_TC,  /*!< LPDMA1 HW Trigger is LPDMA2_CH0_TC */
  HAL_LPDMA1_TRIGGER_LPDMA2_CH1_TC = LL_LPDMA1_TRIGGER_LPDMA2_CH1_TC,  /*!< LPDMA1 HW Trigger is LPDMA2_CH1_TC */
  HAL_LPDMA1_TRIGGER_LPDMA2_CH2_TC = LL_LPDMA1_TRIGGER_LPDMA2_CH2_TC,  /*!< LPDMA1 HW Trigger is LPDMA2_CH2_TC */
  HAL_LPDMA1_TRIGGER_LPDMA2_CH3_TC = LL_LPDMA1_TRIGGER_LPDMA2_CH3_TC,  /*!< LPDMA1 HW Trigger is LPDMA2_CH3_TC */
#if defined (LPDMA2_CH4)
  HAL_LPDMA1_TRIGGER_LPDMA2_CH4_TC = LL_LPDMA1_TRIGGER_LPDMA2_CH4_TC,  /*!< LPDMA1 HW Trigger is LPDMA2_CH4_TC */
#endif /* LPDMA2_CH4 */
#if defined (LPDMA2_CH5)
  HAL_LPDMA1_TRIGGER_LPDMA2_CH5_TC = LL_LPDMA1_TRIGGER_LPDMA2_CH5_TC,  /*!< LPDMA1 HW Trigger is LPDMA2_CH5_TC */
#endif /* LPDMA2_CH5 */
#if defined (LPDMA2_CH6)
  HAL_LPDMA1_TRIGGER_LPDMA2_CH6_TC = LL_LPDMA1_TRIGGER_LPDMA2_CH6_TC,  /*!< LPDMA1 HW Trigger is LPDMA2_CH6_TC */
#endif /* LPDMA2_CH6 */
#if defined (LPDMA2_CH7)
  HAL_LPDMA1_TRIGGER_LPDMA2_CH7_TC = LL_LPDMA1_TRIGGER_LPDMA2_CH7_TC,  /*!< LPDMA1 HW Trigger is LPDMA2_CH7_TC */
#endif /* LPDMA2_CH7 */
#endif /* LPDMA2 */
#if defined(COMP2)
  HAL_LPDMA1_TRIGGER_COMP2_OUT     = LL_LPDMA1_TRIGGER_COMP2_OUT,      /*!< LPDMA1 HW Trigger is COMP2_OUT     */
#endif /* COMP2 */

#if defined(LPDMA2)
  /* LPDMA2 triggers */
  HAL_LPDMA2_TRIGGER_EXTI0         = LL_LPDMA2_TRIGGER_EXTI0,          /*!< LPDMA2 HW Trigger is EXTI0         */
  HAL_LPDMA2_TRIGGER_EXTI1         = LL_LPDMA2_TRIGGER_EXTI1,          /*!< LPDMA2 HW Trigger is EXTI1         */
  HAL_LPDMA2_TRIGGER_EXTI2         = LL_LPDMA2_TRIGGER_EXTI2,          /*!< LPDMA2 HW Trigger is EXTI2         */
  HAL_LPDMA2_TRIGGER_EXTI3         = LL_LPDMA2_TRIGGER_EXTI3,          /*!< LPDMA2 HW Trigger is EXTI3         */
  HAL_LPDMA2_TRIGGER_EXTI4         = LL_LPDMA2_TRIGGER_EXTI4,          /*!< LPDMA2 HW Trigger is EXTI4         */
  HAL_LPDMA2_TRIGGER_EXTI5         = LL_LPDMA2_TRIGGER_EXTI5,          /*!< LPDMA2 HW Trigger is EXTI5         */
  HAL_LPDMA2_TRIGGER_EXTI6         = LL_LPDMA2_TRIGGER_EXTI6,          /*!< LPDMA2 HW Trigger is EXTI6         */
  HAL_LPDMA2_TRIGGER_EXTI7         = LL_LPDMA2_TRIGGER_EXTI7,          /*!< LPDMA2 HW Trigger is EXTI7         */
  HAL_LPDMA2_TRIGGER_TAMP_TRG1     = LL_LPDMA2_TRIGGER_TAMP_TRG1,      /*!< LPDMA2 HW Trigger is TAMP_TRG1     */
  HAL_LPDMA2_TRIGGER_TAMP_TRG2     = LL_LPDMA2_TRIGGER_TAMP_TRG2,      /*!< LPDMA2 HW Trigger is TAMP_TRG2     */
  HAL_LPDMA2_TRIGGER_TAMP_TRG3     = LL_LPDMA2_TRIGGER_TAMP_TRG3,      /*!< LPDMA2 HW Trigger is TAMP_TRG3     */
#if defined(LPTIM1)
  HAL_LPDMA2_TRIGGER_LPTIM1_CH1    = LL_LPDMA2_TRIGGER_LPTIM1_CH1,     /*!< LPDMA2 HW Trigger is LPTIM1_CH1    */
  HAL_LPDMA2_TRIGGER_LPTIM1_CH2    = LL_LPDMA2_TRIGGER_LPTIM1_CH2,     /*!< LPDMA2 HW Trigger is LPTIM1_CH2    */
#endif /* LPTIM1 */
  HAL_LPDMA2_TRIGGER_RTC_ALRA_TRG  = LL_LPDMA2_TRIGGER_RTC_ALRA_TRG,   /*!< LPDMA2 HW Trigger is RTC_ALRA_TRG  */
  HAL_LPDMA2_TRIGGER_RTC_ALRB_TRG  = LL_LPDMA2_TRIGGER_RTC_ALRB_TRG,   /*!< LPDMA2 HW Trigger is RTC_ALRB_TRG  */
  HAL_LPDMA2_TRIGGER_RTC_WUT_TRG   = LL_LPDMA2_TRIGGER_RTC_WUT_TRG,    /*!< LPDMA2 HW Trigger is RTC_WUT_TRG   */
  HAL_LPDMA2_TRIGGER_TIM2_TRGO     = LL_LPDMA2_TRIGGER_TIM2_TRGO,      /*!< LPDMA2 HW Trigger is TIM2_TRGO     */
  HAL_LPDMA2_TRIGGER_TIM15_TRGO    = LL_LPDMA2_TRIGGER_TIM15_TRGO,     /*!< LPDMA2 HW Trigger is TIM15_TRGO    */
  HAL_LPDMA2_TRIGGER_COMP1_OUT     = LL_LPDMA2_TRIGGER_COMP1_OUT,      /*!< LPDMA2 HW Trigger is COMP1_OUT     */
  HAL_LPDMA2_TRIGGER_EVENTOUT      = LL_LPDMA2_TRIGGER_EVENTOUT,       /*!< LPDMA2 HW Trigger is EVENTOUT      */
  HAL_LPDMA2_TRIGGER_LPDMA1_CH0_TC = LL_LPDMA2_TRIGGER_LPDMA1_CH0_TC,  /*!< LPDMA2 HW Trigger is LPDMA1_CH0_TC */
  HAL_LPDMA2_TRIGGER_LPDMA1_CH1_TC = LL_LPDMA2_TRIGGER_LPDMA1_CH1_TC,  /*!< LPDMA2 HW Trigger is LPDMA1_CH1_TC */
  HAL_LPDMA2_TRIGGER_LPDMA1_CH2_TC = LL_LPDMA2_TRIGGER_LPDMA1_CH2_TC,  /*!< LPDMA2 HW Trigger is LPDMA1_CH2_TC */
  HAL_LPDMA2_TRIGGER_LPDMA1_CH3_TC = LL_LPDMA2_TRIGGER_LPDMA1_CH3_TC,  /*!< LPDMA2 HW Trigger is LPDMA1_CH3_TC */
#if defined (LPDMA1_CH4)
  HAL_LPDMA2_TRIGGER_LPDMA1_CH4_TC = LL_LPDMA2_TRIGGER_LPDMA1_CH4_TC,  /*!< LPDMA2 HW Trigger is LPDMA1_CH4_TC */
#endif /* LPDMA1_CH4 */
#if defined (LPDMA1_CH5)
  HAL_LPDMA2_TRIGGER_LPDMA1_CH5_TC = LL_LPDMA2_TRIGGER_LPDMA1_CH5_TC,  /*!< LPDMA2 HW Trigger is LPDMA1_CH5_TC */
#endif /* LPDMA1_CH5 */
#if defined (LPDMA1_CH6)
  HAL_LPDMA2_TRIGGER_LPDMA1_CH6_TC = LL_LPDMA2_TRIGGER_LPDMA1_CH6_TC,  /*!< LPDMA2 HW Trigger is LPDMA1_CH6_TC */
#endif /* LPDMA1_CH6 */
#if defined (LPDMA1_CH7)
  HAL_LPDMA2_TRIGGER_LPDMA1_CH7_TC = LL_LPDMA2_TRIGGER_LPDMA1_CH7_TC,  /*!< LPDMA2 HW Trigger is LPDMA1_CH7_TC */
#endif /* LPDMA1_CH7 */
  HAL_LPDMA2_TRIGGER_LPDMA2_CH0_TC = LL_LPDMA2_TRIGGER_LPDMA2_CH0_TC,  /*!< LPDMA2 HW Trigger is LPDMA2_CH0_TC */
  HAL_LPDMA2_TRIGGER_LPDMA2_CH1_TC = LL_LPDMA2_TRIGGER_LPDMA2_CH1_TC,  /*!< LPDMA2 HW Trigger is LPDMA2_CH1_TC */
  HAL_LPDMA2_TRIGGER_LPDMA2_CH2_TC = LL_LPDMA2_TRIGGER_LPDMA2_CH2_TC,  /*!< LPDMA2 HW Trigger is LPDMA2_CH2_TC */
  HAL_LPDMA2_TRIGGER_LPDMA2_CH3_TC = LL_LPDMA2_TRIGGER_LPDMA2_CH3_TC,  /*!< LPDMA2 HW Trigger is LPDMA2_CH3_TC */
#if defined (LPDMA2_CH4)
  HAL_LPDMA2_TRIGGER_LPDMA2_CH4_TC = LL_LPDMA2_TRIGGER_LPDMA2_CH4_TC,  /*!< LPDMA2 HW Trigger is LPDMA2_CH4_TC */
#endif /* LPDMA2_CH4 */
#if defined (LPDMA2_CH5)
  HAL_LPDMA2_TRIGGER_LPDMA2_CH5_TC = LL_LPDMA2_TRIGGER_LPDMA2_CH5_TC,  /*!< LPDMA2 HW Trigger is LPDMA2_CH5_TC */
#endif /* LPDMA2_CH5 */
#if defined (LPDMA2_CH6)
  HAL_LPDMA2_TRIGGER_LPDMA2_CH6_TC = LL_LPDMA2_TRIGGER_LPDMA2_CH6_TC,  /*!< LPDMA2 HW Trigger is LPDMA2_CH6_TC */
#endif /* LPDMA2_CH6 */
#if defined (LPDMA2_CH7)
  HAL_LPDMA2_TRIGGER_LPDMA2_CH7_TC = LL_LPDMA2_TRIGGER_LPDMA2_CH7_TC,  /*!< LPDMA2 HW Trigger is LPDMA2_CH7_TC */
#endif /* LPDMA2_CH7 */
#if defined(COMP2)
  HAL_LPDMA2_TRIGGER_COMP2_OUT     = LL_LPDMA2_TRIGGER_COMP2_OUT,      /*!< LPDMA2 HW Trigger is COMP2_OUT     */
#endif /* COMP2 */
#endif /* LPDMA2 */
} hal_dma_trigger_source_t;

/*! DMA channel trigger polarity enumeration definition */
typedef enum
{
  HAL_DMA_TRIGGER_POLARITY_MASKED  = LL_DMA_TRIGGER_POLARITY_MASKED,  /*!< No trigger of the selected DMA request.
                                                                           Masked trigger event                      */
  HAL_DMA_TRIGGER_POLARITY_RISING  = LL_DMA_TRIGGER_POLARITY_RISING,  /*!< Trigger of the selected DMA request on the
                                                                           rising edge of the selected trigger event
                                                                           input                                     */
  HAL_DMA_TRIGGER_POLARITY_FALLING = LL_DMA_TRIGGER_POLARITY_FALLING  /*!< Trigger of the selected DMA request on the
                                                                           falling edge of the selected trigger event
                                                                           input                                     */
} hal_dma_trigger_polarity_t;

/*! DMA channel trigger mode enumeration definition */
typedef enum
{
  HAL_DMA_TRIGGER_BLOCK_TRANSFER          = LL_DMA_TRIGGER_BLOCK_TRANSFER,         /*!< A block transfer is conditioned
                                                                                        by (at least) one hit trigger */
  HAL_DMA_TRIGGER_NODE_TRANSFER           = LL_DMA_TRIGGER_NODE_TRANSFER,    /*!< An LLI link transfer is conditioned by
                                                                                   (at least) one hit trigger         */
  HAL_DMA_TRIGGER_SINGLE_BURST_TRANSFER   = LL_DMA_TRIGGER_SINGLE_BURST_TRANSFER  /*!< A single/burst transfer is
                                                                                       conditioned by (at least) one hit
                                                                                       trigger                        */
} hal_dma_trigger_mode_t;

/*! DMA channel trigger configuration structure definition */
typedef struct
{
  hal_dma_trigger_source_t   source;   /*!< DMA channel trigger event source selection */
  hal_dma_trigger_polarity_t polarity; /*!< DMA channel trigger event polarity         */
  hal_dma_trigger_mode_t     mode;     /*!< DMA channel trigger mode                   */
} hal_dma_trigger_config_t;

