MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dma.h
/*! DMA channel destination data truncation and padding enumeration definition */
typedef enum
{
  HAL_DMA_DEST_DATA_TRUNC_LEFT_PADD_ZERO  = LL_DMA_DEST_DATA_TRUNC_LEFT_PADD_ZERO,  /*!< Destination data left
                                                                                         truncation with zero padding */
  HAL_DMA_DEST_DATA_TRUNC_RIGHT_PADD_SIGN = LL_DMA_DEST_DATA_TRUNC_RIGHT_PADD_SIGN  /*!< Destination data right
                                                                                         truncation with sign padding */
} hal_dma_dest_data_trunc_padd_t;

/*! DMA channel data handling configuration structure definition */
typedef struct
{
  hal_dma_dest_data_trunc_padd_t   trunc_padd;             /*!< DMA channel data truncation or padding mode     */
} hal_dma_data_handling_config_t;

/*! Privileged access level attribute */
typedef enum
{
  HAL_DMA_NPRIV = LL_DMA_ATTR_NPRIV, /*!< DMA non-privileged attribute */
  HAL_DMA_PRIV  = LL_DMA_ATTR_PRIV   /*!< DMA privileged attribute     */
} hal_dma_priv_attr_t;

/*! Attributes lock status */
typedef enum
{
  HAL_DMA_UNLOCKED = 0U, /*!< DMA unlocked attribute */
  HAL_DMA_LOCKED   = 1U    /*!< DMA locked attribute   */
} hal_dma_attr_lock_status_t;

#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
/*! DMA channel half transfer and transfer complete event generation enumeration definition */
typedef enum
{
  HAL_DMA_LINKEDLIST_XFER_EVENT_BLOCK          = LL_DMA_LINKEDLIST_XFER_EVENT_BLOCK,   /*!< The TC event is generated at
                                                                                        the end of each block and the HT
                                                                                        event is generated at the half
                                                                                        of each block                 */
  HAL_DMA_LINKEDLIST_XFER_EVENT_NODE           = LL_DMA_LINKEDLIST_XFER_EVENT_NODE,/*!< The TC event is generated at the
                                                                                        end of each linked list item and
                                                                                        the HT event is generated at the
                                                                                        half of each linked list item */
  HAL_DMA_LINKEDLIST_XFER_EVENT_Q              = LL_DMA_LINKEDLIST_XFER_EVENT_Q    /*!< The TC event is generated at the
                                                                                        end of the last linked list item
                                                                                        and the HT event is generated at
                                                                                        the half of the last linked list
                                                                                        item                          */
} hal_dma_linkedlist_xfer_event_mode_t;

/*! DMA channel linked list configuration structure definition */
typedef struct
{
  hal_dma_priority_t                   priority;   /*!< DMA channel priority level             */
  hal_dma_linkedlist_xfer_event_mode_t xfer_event_mode; /*!< DMA channel transfer event mode        */
} hal_dma_linkedlist_xfer_config_t;

/*! DMA channel linked list execution enumeration definition */
typedef enum
{
  HAL_DMA_LINKEDLIST_EXECUTION_Q    = LL_DMA_LINKEDLIST_EXECUTION_Q,   /*!< Channel executed for the full linked list */
  HAL_DMA_LINKEDLIST_EXECUTION_NODE = LL_DMA_LINKEDLIST_EXECUTION_NODE /*!< Channel executed once for the current LLI */
} hal_dma_linkedlist_execution_mode_t;

/*! DMA channel node configuration enumeration definition */
typedef struct
{
  hal_dma_direct_xfer_config_t         xfer;                    /*!< DMA Channel direct transfer configuration    */
  hal_dma_hardware_request_mode_t      hw_request_mode;         /*!< DMA channel hardware request mode            */
  hal_dma_flow_control_mode_t          flow_ctrl_mode;          /*!< DMA channel flow control mode                */
  hal_dma_linkedlist_xfer_event_mode_t xfer_event_mode;         /*!< DMA Channel transfer event mode              */
  hal_dma_trigger_config_t             trigger;                 /*!< DMA Channel trigger configuration            */
  hal_dma_data_handling_config_t       data_handling;           /*!< DMA Channel data handling configuration      */
  uint32_t                             src_addr;                /*!< DMA Channel source address                   */
  uint32_t                             dest_addr;               /*!< DMA Channel destination address              */
  uint32_t                             size_byte;               /*!< DMA Channel size in byte                     */
} hal_dma_node_config_t;

/*! DMA channel node type enumeration definition */
typedef enum
{
  HAL_DMA_NODE_LINEAR_ADDRESSING = 0x05U, /*!< Linear addressing DMA node */
} hal_dma_node_type_t;

/*! DMA linked list node structure definition */
typedef struct
{
  uint32_t regs[LL_DMA_NODE_REGISTER_NUM]; /*!< Specifies the physical DMA channel node registers description */
  uint32_t info;                           /*!< Specified the physical DMA channel node information           */
} hal_dma_node_t;
#endif /* USE_HAL_DMA_LINKEDLIST */

typedef struct hal_dma_handle_s hal_dma_handle_t; /*!< HAL DMA channel handle structure type */

/*! DMA channel process callback type definition */
typedef void (*hal_dma_cb_t)(hal_dma_handle_t *hdma);

/*! HAL DMA channel handle Structure definition */
struct hal_dma_handle_s
{
  hal_dma_channel_t                instance;          /*!< DMA channel instance                        */
  void                             *p_parent;         /*!< DMA channel parent                          */
  volatile hal_dma_state_t         global_state;      /*!< DMA channel transfer state                  */
#if defined(USE_HAL_DMA_GET_LAST_ERRORS) && (USE_HAL_DMA_GET_LAST_ERRORS == 1)
  volatile uint32_t                last_error_codes; /*!< DMA channel transfer error codes             */
#endif /* USE_HAL_DMA_GET_LAST_ERRORS */
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  volatile hal_dma_xfer_mode_t     xfer_mode;         /*!< DMA channel transfer mode                   */
  hal_dma_node_t                   *p_head_node;      /*!< DMA channel q                               */
#endif /* USE_HAL_DMA_LINKEDLIST */
  hal_dma_cb_t p_xfer_halfcplt_cb;                    /*!< DMA channel half transfer complete callback */
  hal_dma_cb_t p_xfer_cplt_cb;                        /*!< DMA channel transfer complete callback      */
  hal_dma_cb_t p_xfer_abort_cb;                       /*!< DMA channel transfer Abort callback         */
  hal_dma_cb_t p_xfer_suspend_cb;                     /*!< DMA channel transfer Suspend callback       */
  hal_dma_cb_t p_xfer_error_cb;                       /*!< DMA channel transfer error callback         */
#if defined(USE_HAL_DMA_USER_DATA) && (USE_HAL_DMA_USER_DATA == 1)
  const void                        *p_user_data;     /*!< DMA channel user data                       */
#endif /* USE_HAL_DMA_USER_DATA */
};
/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @defgroup DMA_Exported_Functions HAL DMA Functions
  * @{
  */

