MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dma.h
hal_status_t HAL_DMA_FillNodeFlowControlMode(hal_dma_node_t *p_node, hal_dma_flow_control_mode_t flow_control_mode);
hal_dma_flow_control_mode_t HAL_DMA_GetNodeFlowControlMode(const hal_dma_node_t *p_node);

hal_status_t HAL_DMA_FillNodeXferEventMode(hal_dma_node_t *p_node,
                                           hal_dma_linkedlist_xfer_event_mode_t xfer_event_mode);
hal_dma_linkedlist_xfer_event_mode_t HAL_DMA_GetNodeXferEventMode(const hal_dma_node_t *p_node);

hal_status_t HAL_DMA_FillNodeTrigger(hal_dma_node_t *p_node, const hal_dma_trigger_config_t *p_config);
void HAL_DMA_GetNodeTrigger(const hal_dma_node_t *p_node, hal_dma_trigger_config_t *p_config);

hal_status_t HAL_DMA_FillNodeDataHandling(hal_dma_node_t *p_node, const hal_dma_data_handling_config_t *p_config);
void HAL_DMA_GetNodeDataHandling(const hal_dma_node_t *p_node, hal_dma_data_handling_config_t *p_config);

hal_status_t HAL_DMA_FillNodeData(hal_dma_node_t *p_node, uint32_t src_addr, uint32_t dest_addr, uint32_t size_byte);
void HAL_DMA_GetNodeData(const hal_dma_node_t *p_node, uint32_t *p_src_addr, uint32_t *p_dest_addr,
                         uint32_t *p_size_byte);

/* Conversion queue APIs */
hal_status_t HAL_DMA_ConvertQNodesToDynamic(hal_q_t *p_q);
hal_status_t HAL_DMA_ConvertQNodesToStatic(hal_q_t *p_q);
/**
  * @}
  */
#endif /* USE_HAL_DMA_LINKEDLIST */

/** @defgroup DMA_Exported_Functions_Group4 Process management functions
  * @{
  */
/* Start APIs */
hal_status_t HAL_DMA_StartDirectXfer(hal_dma_handle_t *hdma, uint32_t src_addr, uint32_t dest_addr, uint32_t size_byte);
hal_status_t HAL_DMA_StartDirectXfer_IT(hal_dma_handle_t *hdma, uint32_t src_addr, uint32_t dest_addr,
                                        uint32_t size_byte);
hal_status_t HAL_DMA_StartDirectXfer_IT_Opt(hal_dma_handle_t *hdma, uint32_t src_addr, uint32_t dest_addr,
                                            uint32_t size_byte, uint32_t interrupts);
hal_status_t HAL_DMA_StartPeriphXfer_IT_Opt(hal_dma_handle_t *hdma, uint32_t src_addr, uint32_t dest_addr,
                                            uint32_t size_byte, uint32_t interrupts);

#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
hal_status_t HAL_DMA_StartLinkedListXfer(hal_dma_handle_t *hdma, const hal_q_t *p_q);
hal_status_t HAL_DMA_StartLinkedListXfer_IT(hal_dma_handle_t *hdma, const hal_q_t *p_q);
hal_status_t HAL_DMA_StartLinkedListXfer_IT_Opt(hal_dma_handle_t *hdma, const hal_q_t *p_q, uint32_t interrupts);
#endif /* USE_HAL_DMA_LINKEDLIST */

/* Abort APIs */
hal_status_t HAL_DMA_Abort(hal_dma_handle_t *hdma);
hal_status_t HAL_DMA_Abort_IT(hal_dma_handle_t *hdma);

/* Suspend and resume APIs */
hal_status_t HAL_DMA_Suspend(hal_dma_handle_t *hdma);
hal_status_t HAL_DMA_Suspend_IT(hal_dma_handle_t *hdma);
hal_status_t HAL_DMA_Resume(hal_dma_handle_t *hdma);

/* Polling for transfer API */
hal_status_t HAL_DMA_PollForXfer(hal_dma_handle_t *hdma, hal_dma_xfer_level_t xfer_level, uint32_t timeout_ms);

/* IRQHandler API */
void HAL_DMA_IRQHandler(hal_dma_handle_t *hdma);
/**
  * @}
  */

/** @defgroup DMA_Exported_Functions_Group5 Callbacks functions
  * @{
  */
/* Register callback APIs */
hal_status_t HAL_DMA_RegisterXferHalfCpltCallback(hal_dma_handle_t *hdma, hal_dma_cb_t callback);
hal_status_t HAL_DMA_RegisterXferCpltCallback(hal_dma_handle_t *hdma, hal_dma_cb_t callback);
hal_status_t HAL_DMA_RegisterXferAbortCallback(hal_dma_handle_t *hdma, hal_dma_cb_t callback);
hal_status_t HAL_DMA_RegisterXferSuspendCallback(hal_dma_handle_t *hdma, hal_dma_cb_t callback);
hal_status_t HAL_DMA_RegisterXferErrorCallback(hal_dma_handle_t *hdma, hal_dma_cb_t callback);

/* Callbacks APIs */
void HAL_DMA_XferHalfCpltCallback(hal_dma_handle_t *hdma);
void HAL_DMA_XferCpltCallback(hal_dma_handle_t *hdma);
void HAL_DMA_XferAbortCallback(hal_dma_handle_t *hdma);
void HAL_DMA_XferSuspendCallback(hal_dma_handle_t *hdma);
void HAL_DMA_XferErrorCallback(hal_dma_handle_t *hdma);

#if defined(USE_HAL_DMA_USER_DATA) && (USE_HAL_DMA_USER_DATA == 1)
void HAL_DMA_SetUserData(hal_dma_handle_t *hdma, const void *p_user_data);
const void *HAL_DMA_GetUserData(const hal_dma_handle_t *hdma);
#endif /* USE_HAL_DMA_USER_DATA */
/**
  * @}
  */

/** @defgroup DMA_Exported_Functions_Group6 Status functions
  * @{
  */
/* Get transfer data APIs */
uint32_t HAL_DMA_GetDirectXferRemainingDataByte(const hal_dma_handle_t *hdma);

/* State APIs */
hal_dma_state_t HAL_DMA_GetState(const hal_dma_handle_t *hdma);

#if defined(USE_HAL_DMA_GET_LAST_ERRORS) && (USE_HAL_DMA_GET_LAST_ERRORS == 1)
uint32_t HAL_DMA_GetLastErrorCodes(const hal_dma_handle_t *hdma);
#endif /* USE_HAL_DMA_GET_LAST_ERRORS */
/**
  * @}
  */

/**
  * @}
  */

/* Private functions -------------------------------------------------------------------------------------------------*/
/** @defgroup DMA_Private_Functions DMA Private Functions
  * @{
  */
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)

/**
  * @brief Get Node information for a DMA channel linear addressing.
  * @param p_next_offset_addr Pointer to next node address offset
  * @param p_addressing_mode  Pointer to node addressing mode
  */
__STATIC_INLINE void HAL_DMA_LinearAddr_GetNodeInfo(uint32_t *p_next_offset_addr,
                                                    hal_q_addressing_mode_t *p_addressing_mode)
{
  *p_next_offset_addr = (uint32_t)LL_DMA_NODE_LINEAR_ADDRESSING_OFFSET;
  *p_addressing_mode  = HAL_Q_ADDRESSING_DIRECT;
}

/**
  * @brief Set DMA node address.
  * @param head_node_addr   Head node address
  * @param prev_node_addr   Previous node address
  * @param next_node_addr   Next node address
  * @param node_addr_offset Node address offset
  */
__STATIC_INLINE void HAL_DMA_SetNodeAddress(uint32_t head_node_addr, uint32_t prev_node_addr, uint32_t next_node_addr,
                                            uint32_t node_addr_offset)
{
  STM32_UNUSED(head_node_addr);

  STM32_MODIFY_REG((*(uint32_t *)(prev_node_addr + node_addr_offset)), (LL_DMA_UPDATE_ALL | DMA_CLLR_LA),
                   (next_node_addr & DMA_CLLR_LA) | LL_DMA_UPDATE_ALL);
}

/**
  * @brief  Get DMA node address.
  * @param  head_node_addr    Head node address
  * @param  current_node_addr Current node address
  * @param  node_addr_offset  Node address offset
  * @retval uint32_t          DMA node address
  */
__STATIC_INLINE uint32_t HAL_DMA_GetNodeAddress(uint32_t head_node_addr, uint32_t current_node_addr,
                                                uint32_t node_addr_offset)
{
  STM32_UNUSED(head_node_addr);

  return (((uint32_t)current_node_addr & DMA_CLBAR_LBA) \
          + (*(uint32_t *)(((uint32_t)current_node_addr) + node_addr_offset) & DMA_CLLR_LA));
}
#endif /* USE_HAL_DMA_LINKEDLIST */
/**
  * @}
  */

/* Exported variables ------------------------------------------------------------------------------------------------*/
/** @defgroup DMA_Exported_Variables HAL DMA Variables
  * @{
  */
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)

/*!  HAL DMA linear addressing operation descriptor variables definition */
static const hal_q_desc_ops_t HAL_DMA_LinearAddressing_DescOps =
{
  HAL_DMA_LinearAddr_GetNodeInfo,
  HAL_DMA_SetNodeAddress,
  HAL_DMA_GetNodeAddress
};
#endif /* USE_HAL_DMA_LINKEDLIST */
/**
  * @}
  */

/**
  * @}
  */

#endif /* (defined (LPDMA1) || defined (LPDMA2)) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32C5XX_HAL_DMA_H */
